Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-zajmnx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-auudf51p4c-zajmnx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-auudf51p4c-budf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-auudf51p4c-zjwczl-ANY-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-auudf51p4c-budf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-auudf51p4c-19r55o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VOWED91CBL3B]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=pihbmfom84-prod-*/*]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-zjwczl-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=e4015c17-a4f1-736a-4c08-3778cefdc10a]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=4144518607]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Still reading... [1m30s elapsed]
module.webgui.data.external.build: Read complete after 1m33s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=2843852217012278194]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=910082800170648383]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:7077423ace5149795e3f4712c6f6c497935479b9bd9ad912c84cb7f4a651da41460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:7077423ace5149795e3f4712c6f6c497935479b9bd9ad912c84cb7f4a651da41" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:6ee1cb86ecbe3330ca25957b8939c94a99728aa3f9e11aad271d34f7d9640fc5460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:6ee1cb86ecbe3330ca25957b8939c94a99728aa3f9e11aad271d34f7d9640fc5" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:7c186eea7bfc3d94ce20c34b5cb73bfd8dc7ecd8741f16cf6cc1039416bc7654460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:7c186eea7bfc3d94ce20c34b5cb73bfd8dc7ecd8741f16cf6cc1039416bc7654" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-analyses" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_analyses"
        name               = "sbeacon_analyses"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250829_031759_00359_w8yn4" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/analyses/" -> "s3://gasi-metadata-20250513021731641000000004/analyses"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-biosamples" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_biosamples"
        name               = "sbeacon_biosamples"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250829_031759_00047_7447b" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/biosamples/" -> "s3://gasi-metadata-20250513021731641000000004/biosamples"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (22 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-datasets" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_datasets"
        name               = "sbeacon_datasets"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250829_031758_00047_mnzrn" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_assemblyid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/datasets/" -> "s3://gasi-metadata-20250513021731641000000004/datasets"
          - number_of_buckets         = 10 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (14 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-individuals" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_individuals"
        name               = "sbeacon_individuals"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250829_031759_00055_8934v" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/individuals/" -> "s3://gasi-metadata-20250513021731641000000004/individuals"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (15 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-relations" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_relations"
        name               = "sbeacon_relations"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "presto_query_id"    = "20250829_031805_00231_vjsat" -> null
          - "presto_version"     = "0.215-24159-g256e5cb" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "individualid",
              - "biosampleid",
              - "runid",
              - "analysisid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/relations/" -> "s3://gasi-metadata-20250513021731641000000004/relations"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be updated in-place
  ~ resource "aws_glue_catalog_table" "sbeacon-runs" {
        id                 = "460722568061:sbeacon_metadata:sbeacon_runs"
        name               = "sbeacon_runs"
      - owner              = "460722568061" -> null
      ~ parameters         = {
          - "auto.purge"         = "false" -> null
          - "bucketing_format"   = "hive" -> null
          - "bucketing_version"  = "1" -> null
          - "has_encrypted_data" = "false" -> null
          - "numFiles"           = "-1" -> null
          - "totalSize"          = "-1" -> null
          - "transactional"      = "false" -> null
          - "trino_query_id"     = "20250829_031759_00279_n2bwg" -> null
          - "trino_version"      = "0.215-24313-g4bf737e" -> null
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ storage_descriptor {
          ~ bucket_columns            = [
              - "id",
              - "_datasetid",
            ]
          ~ location                  = "s3://gasi-metadata-20250513021731641000000004/runs/" -> "s3://gasi-metadata-20250513021731641000000004/runs"
          - number_of_buckets         = 50 -> null
            # (6 unchanged attributes hidden)

          ~ ser_de_info {
              + name                  = "ORC"
              ~ parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
                # (1 unchanged attribute hidden)
            }

            # (13 unchanged blocks hidden)
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9" -> (known after apply)
      ~ code_sha256                 = "0sdaIDREVWtyxVsqKU9Zm2Bzzf1WzwGV9F0tVfSKdpc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T08:48:03.559+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "k1Jnw+dc3n30iVkfZznhVmxazHxQ5+9+NMzBYA1wzPGkqh0E+75QXUNlCClFp/YdiojC/7qs55E5W+7yuIuMew==" -> "craw3IhLR+LMdnMylQDDS1+dnR5NxKeafS1qE82BEcqHZjw68JhWJgKz82DGANq5fO79HzvOuXyuHwWd5iwnaA==" # forces replacement
      ~ source_code_size            = 18422754 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK" -> "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX2NyZWF0ZSBjb25maWd1cmF0aW9uLi4uIgoKIyBXYWl0IGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlIChtYXhpbXVtIDUgbWludXRlcykKZWNobyAiV2FpdGluZyBmb3IgY29uZGEgdG8gYmVjb21lIGF2YWlsYWJsZS4uLiIKZm9yIGkgaW4gezEuLjMwMH07IGRvCiAgaWYgWyAtZiAiL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2giIF0gJiYgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoICYmIGNvbmRhIGluZm8gPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgICBlY2hvICJDb25kYSBpcyBhdmFpbGFibGUgYWZ0ZXIgJGkgc2Vjb25kcy4iCiAgICBicmVhawogIGZpCiAgc2xlZXAgMQpkb25lCgojIEFjdGl2YXRlIHB5dGhvbjMgZW52aXJvbm1lbnQgaWYgY29uZGEgaXMgcmVhZHkKaWYgY29tbWFuZCAtdiBjb25kYSA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICBlY2hvICJBY3RpdmF0aW5nIGNvbmRhIGVudmlyb25tZW50Li4uIgogIHNvdXJjZSAvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaAogIGNvbmRhIGFjdGl2YXRlIHB5dGhvbjMKCiAgIyBEaXNhYmxlIEp1cHl0ZXJMYWIgZG93bmxvYWQgYW5kIGV4cG9ydCBleHRlbnNpb25zCiAgSlVQWVRFUl9CSU49Ii9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9lbnZzL0p1cHl0ZXJTeXN0ZW1FbnYvYmluL2p1cHl0ZXIiCgogIGlmIFsgLWYgIiRKVVBZVEVSX0JJTiIgXSAmJiAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIC0taGVscCA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIlVzaW5nIEp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBiaW5hcnkiCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZG93bmxvYWQKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9maWxlYnJvd3Nlci1leHRlbnNpb246ZG93bmxvYWQgIAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2RvY21hbmFnZXItZXh0ZW5zaW9uOmV4cG9ydAogIGVsc2UKICAgIGVjaG8gIkp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBkb2VzIG5vdCBzdXBwb3J0IGxhYmV4dGVuc2lvbiwgdHJ5aW5nIGZhbGxiYWNrIgogIGZpCgogICMgQ3JlYXRlIGhhbmRsZXJzLnB5IHRvIGJsb2NrIGZpbGUgZG93bmxvYWRzCiAgZWNobyAiQ3JlYXRpbmcgaGFuZGxlcnMucHkgdG8gZGlzYWJsZSBkb3dubG9hZHMuLi4iCiAgbWtkaXIgLXAgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjYXQgPDwgJ0VORCcgPiAvaG9tZS9lYzItdXNlci8uanVweXRlci9oYW5kbGVycy5weQpmcm9tIHRvcm5hZG8gaW1wb3J0IHdlYgpmcm9tIG5vdGVib29rLmJhc2UuaGFuZGxlcnMgaW1wb3J0IElQeXRob25IYW5kbGVyCgpjbGFzcyBGb3JiaWRGaWxlc0hhbmRsZXIoSVB5dGhvbkhhbmRsZXIpOgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBoZWFkKHNlbGYsIHBhdGgpOgogICAgc2VsZi5sb2cuaW5mbygiSEVBRDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQoKICBAd2ViLmF1dGhlbnRpY2F0ZWQKICBkZWYgZ2V0KHNlbGYsIHBhdGgsIGluY2x1ZGVfYm9keT1UcnVlKToKICAgIHNlbGYubG9nLmluZm8oIkdFVDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQpFTkQKCiAgIyBDcmVhdGUganVweXRlcl9ub3RlYm9va19jb25maWcucHkgdG8gY29uZmlndXJlIHRoZSBoYW5kbGVyCiAgZWNobyAiQXBwbHlpbmcgSnVweXRlciBjb25maWd1cmF0aW9uLi4uIgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2p1cHl0ZXJfbm90ZWJvb2tfY29uZmlnLnB5CmltcG9ydCBvcywgc3lzCnN5cy5wYXRoLmFwcGVuZCgnL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvJykKaW1wb3J0IGhhbmRsZXJzCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfY2xhc3MgPSAnaGFuZGxlcnMuRm9yYmlkRmlsZXNIYW5kbGVyJwpjLkNvbnRlbnRzTWFuYWdlci5maWxlc19oYW5kbGVyX3BhcmFtcyA9IHt9CkVORAoKICAjIFNldCBjb3JyZWN0IGZpbGUgcGVybWlzc2lvbnMKICBlY2hvICJTZXR0aW5nIGZpbGUgcGVybWlzc2lvbnMuLi4iCiAgY2hvd24gLVIgZWMyLXVzZXI6ZWMyLXVzZXIgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjaG1vZCAtUiA3NTUgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKCiAgIyBSZXN0YXJ0IEp1cHl0ZXIgc2VydmVyIHRvIGFwcGx5IGNoYW5nZXMKICBlY2hvICJBdHRlbXB0aW5nIHRvIHJlc3RhcnQgSnVweXRlciBzZXJ2ZXIuLi4iCiAgc3VkbyBzeXN0ZW1jdGwgcmVzdGFydCBqdXB5dGVyLXNlcnZlciB8fCBzdWRvIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9iaW4vanVweXRlci1sYWIgJgogIGVjaG8gIkNvbmZpZ3VyYXRpb24gY29tcGxldGVkLiIKZWxzZQogIGVjaG8gIkNvbmRhIG5vdCBhdmFpbGFibGUgYWZ0ZXIgNSBtaW51dGVzLCBza2lwcGluZyBjb25maWd1cmF0aW9uLiIKZmkKCg=="
      ~ on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK" -> "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX3N0YXJ0IGNvbmZpZ3VyYXRpb24uLi4iCgojIFdhaXQgZm9yIGNvbmRhIHRvIGJlY29tZSBhdmFpbGFibGUgKG1heGltdW0gNSBtaW51dGVzKQplY2hvICJXYWl0aW5nIGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlLi4uIgpmb3IgaSBpbiB7MS4uMzAwfTsgZG8KICBpZiBbIC1mICIvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaCIgXSAmJiBzb3VyY2UgL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2ggJiYgY29uZGEgaW5mbyA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIkNvbmRhIGlzIGF2YWlsYWJsZSBhZnRlciAkaSBzZWNvbmRzLiIKICAgIGJyZWFrCiAgZmkKICBzbGVlcCAxCmRvbmUKCiMgQWN0aXZhdGUgcHl0aG9uMyBlbnZpcm9ubWVudCBpZiBjb25kYSBpcyByZWFkeQppZiBjb21tYW5kIC12IGNvbmRhID4vZGV2L251bGwgMj4mMTsgdGhlbgogIGVjaG8gIkFjdGl2YXRpbmcgY29uZGEgZW52aXJvbm1lbnQuLi4iCiAgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoCiAgY29uZGEgYWN0aXZhdGUgcHl0aG9uMwoKICAjIERpc2FibGUgSnVweXRlckxhYiBkb3dubG9hZCBhbmQgZXhwb3J0IGV4dGVuc2lvbnMKICBKVVBZVEVSX0JJTj0iL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvSnVweXRlclN5c3RlbUVudi9iaW4vanVweXRlciIKCiAgaWYgWyAtZiAiJEpVUFlURVJfQklOIiBdICYmICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gLS1oZWxwID4vZGV2L251bGwgMj4mMTsgdGhlbgogICAgZWNobyAiVXNpbmcgSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGJpbmFyeSIKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9kb2NtYW5hZ2VyLWV4dGVuc2lvbjpkb3dubG9hZAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2ZpbGVicm93c2VyLWV4dGVuc2lvbjpkb3dubG9hZCAgCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZXhwb3J0CiAgZWxzZQogICAgZWNobyAiSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGRvZXMgbm90IHN1cHBvcnQgbGFiZXh0ZW5zaW9uLCB0cnlpbmcgZmFsbGJhY2siCiAgZmkKCiAgIyBDcmVhdGUgaGFuZGxlcnMucHkgdG8gYmxvY2sgZmlsZSBkb3dubG9hZHMKICBlY2hvICJDcmVhdGluZyBoYW5kbGVycy5weSB0byBkaXNhYmxlIGRvd25sb2Fkcy4uLiIKICBta2RpciAtcCAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2hhbmRsZXJzLnB5CmZyb20gdG9ybmFkbyBpbXBvcnQgd2ViCmZyb20gbm90ZWJvb2suYmFzZS5oYW5kbGVycyBpbXBvcnQgSVB5dGhvbkhhbmRsZXIKCmNsYXNzIEZvcmJpZEZpbGVzSGFuZGxlcihJUHl0aG9uSGFuZGxlcik6CiAgQHdlYi5hdXRoZW50aWNhdGVkCiAgZGVmIGhlYWQoc2VsZiwgcGF0aCk6CiAgICBzZWxmLmxvZy5pbmZvKCJIRUFEOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBnZXQoc2VsZiwgcGF0aCwgaW5jbHVkZV9ib2R5PVRydWUpOgogICAgc2VsZi5sb2cuaW5mbygiR0VUOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCkVORAoKICAjIENyZWF0ZSBqdXB5dGVyX25vdGVib29rX2NvbmZpZy5weSB0byBjb25maWd1cmUgdGhlIGhhbmRsZXIKICBlY2hvICJBcHBseWluZyBKdXB5dGVyIGNvbmZpZ3VyYXRpb24gdXNpbmcgY3VzdG9tIGhhbmRsZXIuLi4iCiAgY2F0IDw8ICdFTkQnID4gL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvanVweXRlcl9ub3RlYm9va19jb25maWcucHkKaW1wb3J0IG9zLCBzeXMKc3lzLnBhdGguYXBwZW5kKCcvaG9tZS9lYzItdXNlci8uanVweXRlci8nKQppbXBvcnQgaGFuZGxlcnMKYy5Db250ZW50c01hbmFnZXIuZmlsZXNfaGFuZGxlcl9jbGFzcyA9ICdoYW5kbGVycy5Gb3JiaWRGaWxlc0hhbmRsZXInCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfcGFyYW1zID0ge30KRU5ECgogICMgU2V0IGNvcnJlY3QgZmlsZSBwZXJtaXNzaW9ucwogIGVjaG8gIlNldHRpbmcgZmlsZSBwZXJtaXNzaW9ucy4uLiIKICBjaG93biAtUiBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNobW9kIC1SIDc1NSAvaG9tZS9lYzItdXNlci8uanVweXRlcgoKICAjIFJlc3RhcnQgSnVweXRlciBzZXJ2ZXIgdG8gYXBwbHkgY2hhbmdlcwogIGVjaG8gIkF0dGVtcHRpbmcgdG8gcmVzdGFydCBKdXB5dGVyIHNlcnZlci4uLiIKICBzdWRvIHN5c3RlbWN0bCByZXN0YXJ0IGp1cHl0ZXItc2VydmVyIHx8IHN1ZG8gL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2Jpbi9qdXB5dGVyLWxhYiAmCiAgZWNobyAiQ29uZmlndXJhdGlvbiBjb21wbGV0ZWQuIgplbHNlCiAgZWNobyAiQ29uZGEgbm90IGF2YWlsYWJsZSBhZnRlciA1IG1pbnV0ZXMsIHNraXBwaW5nIGNvbmZpZ3VyYXRpb24uIgpmaQo="
        tags      = {}
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10" -> (known after apply)
      ~ code_sha256                 = "SlHR/jYXtfdAZFPdPGbWE8Dkbu/uyc/0ceVSDjKMzD0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T08:47:58.074+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "IJ1Y7lgbRmoG/884OjFCZSALSJaiqFmYDMItgvc1mBHD9zyryb+yui059UdJK9RuZickHcV4TyNbr6tC8uv6ng==" -> "CwQy6drTPtMsrX2wUKyqTty3/iNtAvaJApjJ4bUgMzjkVHTUs1yuVOcksj1qgjBOVKmL+kK5pAcpceTnNX/PZg==" # forces replacement
      ~ source_code_size            = 17951206 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-65-gbe463333+" -> "v1.1.0-62-g0067837e+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "910082800170648383" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "4b8c0053faea54a3b6c83a742311435d63e15e7e" -> "a213664825c0f5a1995f9d8ccd305d3349a27324"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "2843852217012278194" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "4b8c0053faea54a3b6c83a742311435d63e15e7e" -> "a213664825c0f5a1995f9d8ccd305d3349a27324"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "e4015c17-a4f1-736a-4c08-3778cefdc10a" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-65-gbe463333+" -> "v1.1.0-62-g0067837e+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6684673487492547697" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467477174000" -> "1758104811880997800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5823189620458581469" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467176291000" -> "1758104811135053000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7753067421631592020" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467570158000" -> "1758104811565236000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7857361313463266314" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111466023865000" -> "1758104810648968000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "809176198308735103" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111466264054000" -> "1758104811129978800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "d85f7a7f980aa38a9945648dd869683ef2bce09b"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:ef44164a9a01fd76c5734330c3ae7af9c21c7a58a0710a4e36f873226ec86ff2" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:ef44164a9a01fd76c5734330c3ae7af9c21c7a58a0710a4e36f873226ec86ff2" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "15dc9b9bc282ff832f3ad6ffb55228cea885fa4b" -> "d85f7a7f980aa38a9945648dd869683ef2bce09b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/17ff32aa9bf57b5c9f996b78f05ce51a63a1b1cec104c63f3c98a174beb17bb2.zip" -> "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-08-25T08:48:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "499175919151756308" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/17ff32aa9bf57b5c9f996b78f05ce51a63a1b1cec104c63f3c98a174beb17bb2.zip" -> "builds/de823e6698d74d5e282d9a74703d54980cd3b566a4ed6f3f53c04cbf5f09c4b6.zip"
          ~ "timestamp" = "1756111467134071200" -> "1758104811245853000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip" -> "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-25T08:50:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6988839606635245157" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/fa58a01d99f45d7a953775a8a88f96d73bbafc98d2c79b28402755b6d8cfd113.zip" -> "builds/89abea36a8cf0e00358de9e170e2f251e431e6ea4679e8074697691eaca542c7.zip"
          ~ "timestamp" = "1756111466360932200" -> "1758104811575486000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9166110186133897298" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467529512800" -> "1758104812149710000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9153888412160774790" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111466727500000" -> "1758104812245407200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0"
        name        = "sbeacon-backend-generateReports-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "s3:PutObject" -> [
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      ~ Resource = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/clinical-workflows/*/reports/*" -> "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/*"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip" -> "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-08-25T08:48:17.459+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8852114330341970823" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip" -> "builds/3f0ca2e3ff80dc59fa3d9c8efc3a6a96ad8109a75a92dc97b77e9405f46cc15e.zip"
          ~ "timestamp" = "1756111466863931000" -> "1758104812033439000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4695511287234543700" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467369546000" -> "1758104811718901000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9210519233497162754" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467767656000" -> "1758104810572849000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "798892279029106317" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756111467139458800" -> "1758104811154673000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip" -> "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-08-25T08:49:02.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7695704126110082091" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip" -> "builds/632488536b796872d1863707cdd11d85a1dd8af4e2f3c3ad65d230a1552cd62b.zip"
          ~ "timestamp" = "1756111467862540000" -> "1758104811517886000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6782779297099
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.